#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int a, e, d;
	cout << "Введите число (10 - 40)" << endl;
	cin >> a;
	d = a % 10;
	e = a / 10;
	if (d == 1)
	{
		if (e == 0)
			cout << "десять ";
		if (e == 1)
			cout << "одиннадцать ";
		if (e == 2)
			cout << "двенадцать ";
		if (e == 3)
			cout << "тринадцать ";
		if (e == 4)
			cout << "четырнадцать ";
		if (e == 5)
			cout << "пятнадцать ";
		if (e == 6)
			cout << "шестнадцать ";
		if (e == 7)
			cout << "семнадцать ";
		if (e == 8)
			cout << "восемнадцать ";
		if (e == 9)
			cout << "девятнадцать ";
		cout << "учебных заданий";
	}
	if (d == 2) 
		cout << "двадцать ";
	if (d == 3) 
		cout << "тридцать ";
	if (d == 4) 
		cout << "сорок ";
	if (d != 1) 
	{
		if (e == 0)
			cout << "учебных заданий"; 
		if (e == 1)
			cout << "одно учебное задание";
		if (e == 2)
			cout << "два учебных задания";
		if (e == 3)
			cout << "три учебных задания";
		if (e == 4)
			cout << "четыре учебных задания";
		if (e == 5)
			cout << "пять учебных заданий";
		if (e == 6)
			cout << "шесть учебных заданий";
		if (e == 7)
			cout << "семь учебных заданий";
		if (e == 8)
			cout << "восемь учебных заданий";
		if (e == 9)
			cout << "девять учебных заданий";
	}
}
